Repository: apple/swift-argument-parser
Catalog: Sources/ArgumentParser/Resources/*.lproj/Localizable.strings
Languages: tr

source: (default)
tr: (öntanımlı)

source: <command>
tr: <komut>

source: <subcommand>
tr: <altkomut>

source: Arguments
tr: Değişkenler

source: Internal error. Invalid state while parsing command-line arguments.
tr: İç hata. Komut satırı değişkenleri ayrıştırılırken geçersiz durum alındı.

source: Internal error. Parsing command-line arguments hit unimplemented code path.
tr: İç hata. Komut satırı değişkenleri ayrıştırımı henüz eklenmemiş kod yoluna çarptı.

source: Missing expected argument
tr: Beklenen değişken eksik.

source: Missing required subcommand.
tr: Gerekli altkomut eksik.

source: Options
tr: Seçenekler

source: Show help information.
tr: Yardım bilgisini göster.

source: Show the version.
tr: Sürümü göster.

source: Subcommands
tr: Altkomutlar

source: Unspecified version
tr: Belirtilmemiş sürüm

source: value
tr: değer

source: (default: %@)
tr: (öntanımlı: %@)

source: Usage: %@
tr: Kullanım: %@

source: OVERVIEW: %@
tr: GENEL BAKIŞ: %@

source: See '%@ <subcommand>' for detailed help.
tr: Ayrıntılı yardım için '%@ <altkomut>' yazın.

source: See '%@ --help' for more information.
tr: Daha fazla bilgi için '%@ --help' yazın.

source: %@ <options>
tr: %@ <seçenekler>

source: Invalid option: %@
tr: Geçersiz seçenek: %@

source: Invalid option: -%@
tr: Geçersiz seçenek: -%@

source: Can't autodetect a supported shell. Please use --generate-completion-script=<shell> with one of: %@
tr: Desteklenen bir kabuk kendiliğinden algılanamıyor. Lütfen aşağıdakilerden biri ile --generate-completion-script=<kabuk> kullanın: %@

source: Can't generate completion scripts for '%@'. Please use --generate-completion-script=<shell> with one of: %@
tr: '%@' için tamamlama betikleri oluşturulamıyor. Lütfen aşağıdakilerden biri ile --generate-completion-script=<kabuk> kullanın: %@

source: Unknown option '%@'.
tr: Bilinmeyen seçenek '%@'.

source: Unknown option '%1$@'. Did you mean '%2$@'?
tr: Bilinmeyen seçenek '%1$@'. Şunu mu demek istediniz: '%2$@'?

source: Missing value for '%1$@ <%2$@>'
tr: '%1$@ <%2$@>' için eksik değer

source: The option '1$%@' does not take any value, but '%2$@' was specified.
tr: '1$%@' seçeneği herhangi bir değer almaz, ancak '%2$@' belirtilmiş.

source: Unexpected argument '%@'
tr: Beklenmedik değişken '%@'

source: %1$@ unexpected arguments: '%2$@'
tr: %1$@ beklenmedik değişken: '%2$@'

source: position %@
tr: %@ konumu

source: Value to be set with %1$@ had already been set with %2$@
tr: %1$@ ile ayarlanacak değer %2$@ ile zaten ayarlanmış

source: Missing expected argument '%@'
tr: Beklenen değişken '%@' eksik

source: Missing one of: '%@'
tr: Şunlardan biri eksik: '%@'

source: The value '%1$@' is invalid for '%2$@ <%3$@>'%4$@
tr: '%1$@' değeri '%2$@ <%3$@>' için geçersiz (%4$@)

source: The value '%1$@' is invalid for '<%2$@>'%3$@
tr: '%1$@' değeri '<%2$@>' için geçersiz (%3$@)

source: The value '%1$@' is invalid for '%2$@'%3$@
tr: '%1$@' değeri '%2$@' için geçersiz (%3$@)

source: The value '%1$@' is invalid.%2$@
tr: '%1$@' değeri geçersiz (%2$@).
